#!/usr/bin/python3

# 有四个数字，分别是：1、2、3、4 提问：能组成多少个互不相同且无重复数字的三位数？各是多少？
for i in range(1, 5):
    for j in range(1, 5):
        for k in range(1, 5):
            if(i != j) and (i != k) and (j != k):
                print('%d%d%d' % (i, j, k))

# 执行结果:
# 123
# 124
# 132
# 134
# 142
# 143
# 213
# 214
# 231
# 234
# 241
# 243
# 312
# 314
# 321
# 324
# 341
# 342
# 412
# 413
# 421
# 423
# 431
# 432



# 简述：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成.
# 提问：从键盘输入当月利润I，求应发放奖金总数？

profit = int(input('净利润:'))
arr = [1000000, 600000, 400000, 200000, 100000, 0]
rat = [0.01, 0.015, 0.03, 0.05, 0.075, 0.1]

bonus = 0
for idex in range(0, 6):
    if profit > arr[idex]:
        bonus += (profit - arr[idex]) * rat[idex]
        print('高于%d的奖金是:%d' % (arr[idex], (profit - arr[idex]) * rat[idex]))
        profit = arr[idex]
print('应发奖金是:%d' % (bonus,))

# 执行结果:
# 净利润:1100000
# 高于1000000的奖金是:1000
# 高于600000的奖金是:6000
# 高于400000的奖金是:6000
# 高于200000的奖金是:10000
# 高于100000的奖金是:7500
# 高于0的奖金是:10000
# 应发奖金是:40500

# arr = [1, 2, 3, 4, 5, 6]
# for i in range(0, 6):
#     print(arr[i])


# 一个整数，它加上100和加上268后都是一个完全平方数 提问：请问该数是多少？
from math import sqrt

for i in range(10000):
    x = int(sqrt(i + 100))
    y = int(sqrt(i + 268))

    if (x * x == i + 100) and (y * y == i + 268):
        print(i)

# 执行结果:
# 21
# 261
# 1581



# 简述：要求输入某年某月某日 提问：求判断输入日期是当年中的第几天？
year = int(input('year: '))
month = int(input('month: '))
day = int(input('day: '))

months_day = (0, 31, 59, 90, 120, 151, 181, 212, 243, 273, 304, 334)

if 0 < month <= 12:
    sum_day = months_day[month - 1]
else:
    print('date error')

sum_day += day

leap = 0

if (year % 400 ==0) or ((year % 4 ==0) and (year % 100 != 0)):
    leap = 1
if (leap == 1) and (month > 2):
    sum_day += 1

print('it is the %dth day' % sum_day)

# 执行结果:
# year: 2013
# month: 3
# day: 2
# it is the 61th day

# year: 2012
# month: 3
# day: 2
# it is the 62th day


# 整数顺序排列问题简述：任意三个整数类型，x、y、z 提问：要求把这三个数，按照由小到大的顺序输出
#  Python解题思路分析： 首先，要想方法把最小的数放到x位上，之后将x与y进行比较； 如果x>y的话，就将x与y的值进行交换； 然后再用x与z进行比较，如果x>z则将x与z的值进行交换，这样能使x最小。
list = []
for i in range(3):
    x = int(input('input a num:'))
    list.append(x)

list.sort()  # 默认是升序排序
print(list)

list.reverse()  # 逆序

print(list)

# 执行结果:
# input a num:2
# input a num:5
# input a num:3
# [2, 3, 5]
# [5, 3, 2]


# 斐波那契数列（Fibonacci sequence），又称黄金分割数列、
# 因数学家列昂纳多·斐波那契以兔子繁殖为例子而引入，故又称为“兔子数列”，
# 指的是这样一个数列：1、1、2、3、5、8、13、21、34

# 输出第10个斐波那契数列
def fib(n):
    a, b = 1, 1
    for i in range(n-1):
        a, b = b, a+b
    return a

print(fib(10))  # 55

# 使用递归解决
def fib(n):
    if n == 1 or n == 2:
        return 1
    return fib(n-1) + fib(n-2)

print(fib(10))  # 55

# 需要输出指定个数的斐波那契数列
def fib(n):
    if n == 1:
        return [1]
    if n == 2:
        return [1, 1]
    fibs = [1, 1]
    for i in range(2, n):
        fibs.append(fibs[-1] + fibs[-2])
    return fibs

print(fib(10))
# 执行结果:
# [1, 1, 2, 3, 5, 8, 13, 21, 34, 55]


# 简述：9*9乘法口诀表。 要求：逐项单位输出。例如1的一行，2的一行，以此类推。
# for row in range(1, 10):
#     for col in range(1, 10):
#         print('%d * %d = %2d' % (row, col, row * col),end='  ')
#     print('')
# 长方形 完整
# 1 * 1 =  1  1 * 2 =  2  1 * 3 =  3  1 * 4 =  4  1 * 5 =  5  1 * 6 =  6  1 * 7 =  7  1 * 8 =  8  1 * 9 =  9
# 2 * 1 =  2  2 * 2 =  4  2 * 3 =  6  2 * 4 =  8  2 * 5 = 10  2 * 6 = 12  2 * 7 = 14  2 * 8 = 16  2 * 9 = 18
# 3 * 1 =  3  3 * 2 =  6  3 * 3 =  9  3 * 4 = 12  3 * 5 = 15  3 * 6 = 18  3 * 7 = 21  3 * 8 = 24  3 * 9 = 27
# 4 * 1 =  4  4 * 2 =  8  4 * 3 = 12  4 * 4 = 16  4 * 5 = 20  4 * 6 = 24  4 * 7 = 28  4 * 8 = 32  4 * 9 = 36
# 5 * 1 =  5  5 * 2 = 10  5 * 3 = 15  5 * 4 = 20  5 * 5 = 25  5 * 6 = 30  5 * 7 = 35  5 * 8 = 40  5 * 9 = 45
# 6 * 1 =  6  6 * 2 = 12  6 * 3 = 18  6 * 4 = 24  6 * 5 = 30  6 * 6 = 36  6 * 7 = 42  6 * 8 = 48  6 * 9 = 54
# 7 * 1 =  7  7 * 2 = 14  7 * 3 = 21  7 * 4 = 28  7 * 5 = 35  7 * 6 = 42  7 * 7 = 49  7 * 8 = 56  7 * 9 = 63
# 8 * 1 =  8  8 * 2 = 16  8 * 3 = 24  8 * 4 = 32  8 * 5 = 40  8 * 6 = 48  8 * 7 = 56  8 * 8 = 64  8 * 9 = 72
# 9 * 1 =  9  9 * 2 = 18  9 * 3 = 27  9 * 4 = 36  9 * 5 = 45  9 * 6 = 54  9 * 7 = 63  9 * 8 = 72  9 * 9 = 81

# for row in range(1, 10):
#     for col in range(row, 10):
#         print('%d * %d = %2d' % (row, col, row * col),end='  ')
#     print('')
# 左上三角
# 1 * 1 =  1  1 * 2 =  2  1 * 3 =  3  1 * 4 =  4  1 * 5 =  5  1 * 6 =  6  1 * 7 =  7  1 * 8 =  8  1 * 9 =  9
# 2 * 2 =  4  2 * 3 =  6  2 * 4 =  8  2 * 5 = 10  2 * 6 = 12  2 * 7 = 14  2 * 8 = 16  2 * 9 = 18
# 3 * 3 =  9  3 * 4 = 12  3 * 5 = 15  3 * 6 = 18  3 * 7 = 21  3 * 8 = 24  3 * 9 = 27
# 4 * 4 = 16  4 * 5 = 20  4 * 6 = 24  4 * 7 = 28  4 * 8 = 32  4 * 9 = 36
# 5 * 5 = 25  5 * 6 = 30  5 * 7 = 35  5 * 8 = 40  5 * 9 = 45
# 6 * 6 = 36  6 * 7 = 42  6 * 8 = 48  6 * 9 = 54
# 7 * 7 = 49  7 * 8 = 56  7 * 9 = 63
# 8 * 8 = 64  8 * 9 = 72
# 9 * 9 =  81


# for row in range(1, 10):
#     for col in range(1, row + 1):
#         print('%d * %d = %2d' % (row, col, row * col),end='  ')
#     print('')

# 左下三角
# 1 * 1 =  1
# 2 * 1 =  2  2 * 2 =  4
# 3 * 1 =  3  3 * 2 =  6  3 * 3 =  9
# 4 * 1 =  4  4 * 2 =  8  4 * 3 = 12  4 * 4 = 16
# 5 * 1 =  5  5 * 2 = 10  5 * 3 = 15  5 * 4 = 20  5 * 5 = 25
# 6 * 1 =  6  6 * 2 = 12  6 * 3 = 18  6 * 4 = 24  6 * 5 = 30  6 * 6 = 36
# 7 * 1 =  7  7 * 2 = 14  7 * 3 = 21  7 * 4 = 28  7 * 5 = 35  7 * 6 = 42  7 * 7 = 49
# 8 * 1 =  8  8 * 2 = 16  8 * 3 = 24  8 * 4 = 32  8 * 5 = 40  8 * 6 = 48  8 * 7 = 56  8 * 8 = 64
# 9 * 1 =  9  9 * 2 = 18  9 * 3 = 27  9 * 4 = 36  9 * 5 = 45  9 * 6 = 54  9 * 7 = 63  9 * 8 = 72  9 * 9 = 81

# for row in range(1, 10):
#     for i in range(1, row):
#         print(end='            ')
#     for col in range(row, 10):
#         print('%d * %d = %2d' % (row, col, row * col),end='  ')
#     print('')

# 右上三角
# 1 * 1 =  1  1 * 2 =  2  1 * 3 =  3  1 * 4 =  4  1 * 5 =  5  1 * 6 =  6  1 * 7 =  7  1 * 8 =  8  1 * 9 =  9
#             2 * 2 =  4  2 * 3 =  6  2 * 4 =  8  2 * 5 = 10  2 * 6 = 12  2 * 7 = 14  2 * 8 = 16  2 * 9 = 18
#                         3 * 3 =  9  3 * 4 = 12  3 * 5 = 15  3 * 6 = 18  3 * 7 = 21  3 * 8 = 24  3 * 9 = 27
#                                     4 * 4 = 16  4 * 5 = 20  4 * 6 = 24  4 * 7 = 28  4 * 8 = 32  4 * 9 = 36
#                                                 5 * 5 = 25  5 * 6 = 30  5 * 7 = 35  5 * 8 = 40  5 * 9 = 45
#                                                             6 * 6 = 36  6 * 7 = 42  6 * 8 = 48  6 * 9 = 54
#                                                                         7 * 7 = 49  7 * 8 = 56  7 * 9 = 63
#                                                                                     8 * 8 = 64  8 * 9 = 72
#                                                                                                  9 * 9 = 81


# for row in range(1, 10):
#     for i in range(1, 10 - row):
#         print(end='            ')
#     for col in range(1, row + 1):
#         print('%d * %d = %2d' % (row, col, row * col),end='  ')
#     print('')

# 右下三角
#                                                                                                 1 * 1 =  1
#                                                                                     2 * 1 =  2  2 * 2 =  4
#                                                                         3 * 1 =  3  3 * 2 =  6  3 * 3 =  9
#                                                             4 * 1 =  4  4 * 2 =  8  4 * 3 = 12  4 * 4 = 16
#                                                 5 * 1 =  5  5 * 2 = 10  5 * 3 = 15  5 * 4 = 20  5 * 5 = 25
#                                     6 * 1 =  6  6 * 2 = 12  6 * 3 = 18  6 * 4 = 24  6 * 5 = 30  6 * 6 = 36
#                         7 * 1 =  7  7 * 2 = 14  7 * 3 = 21  7 * 4 = 28  7 * 5 = 35  7 * 6 = 42  7 * 7 = 49
#             8 * 1 =  8  8 * 2 = 16  8 * 3 = 24  8 * 4 = 32  8 * 5 = 40  8 * 6 = 48  8 * 7 = 56  8 * 8 = 64
# 9 * 1 =  9  9 * 2 = 18  9 * 3 = 27  9 * 4 = 36  9 * 5 = 45  9 * 6 = 54  9 * 7 = 63  9 * 8 = 72  9 * 9 = 81


# Python素数计算及输出练习题要求如下： 简述：区间范围101-200
count = 0
leap = 1
from math import sqrt
from sys import stdout

for m in range(101, 200):
    k = int(sqrt(m + 1))  # sqtr(m)
    for i in range(2, k + 1):  # 从2开始-sqrt(m)
        if m % i == 0:
            leap = 0  # 表示这个数不是素数
            break
    if leap == 1:
        print('%-4d' % m)
        count += 1

    leap = 1  # leap置为1

print('The total is %d' % count)
#
# 执行结果:
# 101
# 103
# 107
# 109
# 113
# 127
# 131
# 137
# 139
# 149
# 151
# 157
# 163
# 167
# 173
# 179
# 181
# 191
# 193
# 197
# 199
# The total is 21

# 水仙花数是指一个 n 位正整数 ( n≥3 )，它的每个位上的数字的 n 次幂之和等于它本身。（例如：1^3 + 5^3+ 3^3 = 153）。
import math

for i in range(100, 1000):
    x = math.floor(i / 100)  # 获取百位数
    y = math.floor((i - x * 100) / 10)  # 获取十位数字
    z = i - math.floor(i/10) * 10  # 获取各位数字
    if i == x**3 + y**3 + z**3:
        print(i, end='  ')
# 执行结果:
# 153  370  371  407